      *=======================================================================
       IDENTIFICATION DIVISION.
      *=======================================================================
       PROGRAM-ID. PROGRAM00X.
      *************************DOCUMENTAÇÂO***********************************
      ************************************************************************
      *DATA:
      *PROGRAMADOR:
      *OBJECTIVO:
      *
      *
      ********************FIM DOCUMENTAÇÂO************************************
      ************************************************************************


      *======================================================================
       ENVIRONMENT DIVISION.

      *=======================================================================

      *----------------------------------------------------------------------
       CONFIGURATION SECTION.

      *-----------------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------------

       INPUT-OUTPUT  SECTION.

      *-----------------------------------------------------------------------

       FILE-CONTROL.


      *=======================================================================
       DATA DIVISION.
      *=======================================================================

      *-----------------------------------------------------------------------
       FILE SECTION.
      *-----------------------------------------------------------------------

      *-----------------------------------------------------------------------
       WORKING-STORAGE SECTION.
       77  saldo pic 9(10) value zeros.
       77  resultado pic 9(10) value zeros.
       77  valor pic 9(10) value zeros.
       77  resto pic 9(10) value zeros.
      *-----------------------------------------------------------------------

      *=======================================================================
       PROCEDURE DIVISION.
      *=======================================================================
       MAIN-PROCEDURE.
           DISPLAY "Inicio".
           DISPLAY saldo.
           DISPLAY resultado.
           DISPLAY valor.
           DISPLAY resto.
           DISPLAY " ".

           DISPLAY "Meio".

           MOVE 63 TO valor.
           DISPLAY valor.
      *     DIVIDE valor BY 2 GIVING resultado REMAINDER resto.
           DIVIDE 2 INTO valor GIVING resultado REMAINDER resto.

           DISPLAY " ".
           DISPLAY "Fim".
           DISPLAY valor.
           DISPLAY resultado.
           DISPLAY resto.

       END PROGRAM PROGRAM00X.
