      *=======================================================================
       IDENTIFICATION DIVISION.
      *=======================================================================
       PROGRAM-ID. PROGRAM00X.
      *************************DOCUMENTAÇÂO***********************************
      ************************************************************************
      *DATA:
      *PROGRAMADOR:
      *OBJECTIVO:
      *
      *
      ********************FIM DOCUMENTAÇÂO************************************
      ************************************************************************


      *======================================================================
       ENVIRONMENT DIVISION.

      *=======================================================================

      *----------------------------------------------------------------------
       CONFIGURATION SECTION.

      *-----------------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------------

       INPUT-OUTPUT  SECTION.

      *-----------------------------------------------------------------------

       FILE-CONTROL.


      *=======================================================================
       DATA DIVISION.
      *=======================================================================

      *-----------------------------------------------------------------------
       FILE SECTION.
      *-----------------------------------------------------------------------

      *-----------------------------------------------------------------------
       WORKING-STORAGE SECTION.

      *-----------------------------------------------------------------------

      *=======================================================================
       PROCEDURE DIVISION.
      *=======================================================================
       MAIN-PROCEDURE.


       END PROGRAM PROGRAM00X.
