      ******************************************************************
      * Author: Jorge Sepúlveda
      * Date: 03 Setembro 2019
      * Purpose: Aprender COBOL
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. OlaMundo.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Ola Miriam".
            STOP RUN.
       END PROGRAM OlaMundo.
