      *=======================================================================
       IDENTIFICATION DIVISION.
      *=======================================================================
       PROGRAM-ID. PROGRAM00X.
      *************************DOCUMENTAÇÂO***********************************
      ************************************************************************
      *DATA:05/09/2019
      *PROGRAMADOR:Jorge Sepúlveda
      *OBJECTIVO:Aprender o SUBTRACT
      *
      *
      ********************FIM DOCUMENTAÇÂO************************************
      ************************************************************************


      *======================================================================
       ENVIRONMENT DIVISION.

      *=======================================================================

      *----------------------------------------------------------------------
       CONFIGURATION SECTION.

      *-----------------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------------

       INPUT-OUTPUT  SECTION.

      *-----------------------------------------------------------------------

       FILE-CONTROL.


      *=======================================================================
       DATA DIVISION.
      *=======================================================================

      *-----------------------------------------------------------------------
       FILE SECTION.
      *-----------------------------------------------------------------------

      *-----------------------------------------------------------------------
       WORKING-STORAGE SECTION.

       77 saldo PIC 9(10) value zeros.
       77 valor PIC 9(10) value ZEROS.
       77 resultado PIC 9(10) value zeros.
      *-----------------------------------------------------------------------

      *=======================================================================
       PROCEDURE DIVISION.
      *=======================================================================
       MAIN-PROCEDURE.
           DISPLAY "Antes:"
           DISPLAY saldo.
           DISPLAY valor.
           DISPLAY resultado.

           MOVE 100 to saldo.
           MOVE 50 TO valor.

           SUBTRACT valor FROM saldo GIVING resultado.

           DISPLAY "Depois:"
           DISPLAY saldo.
           DISPLAY valor.
           DISPLAY resultado.

           DISPLAY "final".
           MOVE resultado to saldo.
           DISPLAY saldo.
           display valor.

       END PROGRAM PROGRAM00X.
